<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 21 changes.</summary>

```diff
+ tailscale_tailnet_key.key will be created
- module.coreos-module-vm.htpasswd_password.password_hash will be destroyed
# (because htpasswd_password.password_hash is not in configuration)
- module.coreos-module-vm.random_pet.random_hostname will be destroyed
# (because random_pet.random_hostname is not in configuration)
- module.coreos-module-vm2.htpasswd_password.password_hash will be destroyed
# (because htpasswd_password.password_hash is not in configuration)
- module.coreos-module-vm2.random_pet.random_hostname will be destroyed
# (because random_pet.random_hostname is not in configuration)
~ module.coreos-periphery-vm.data.ct_config.fedora-coreos-config will be read during apply
# (config refers to values not yet known)
+ module.coreos-periphery-vm.htpasswd_password.password_hash will be created
+ module.coreos-periphery-vm.proxmox_virtual_environment_file.cloud_user_config will be created
+ module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm will be created
+ module.coreos_image.proxmox_virtual_environment_download_file.images["coreos_img"] will be created
+ module.coreos_image.random_id.image_id["coreos_img"] will be created
+ module.debian_bookworm_image.proxmox_virtual_environment_download_file.images["debian_bookworm"] will be created
+ module.debian_bookworm_image.random_id.image_id["debian_bookworm"] will be created
+ module.debian_trixie_image.proxmox_virtual_environment_download_file.images["debian_trixie"] will be created
+ module.debian_trixie_image.random_id.image_id["debian_trixie"] will be created
+ module.ubuntu_jammy_cloud_image.proxmox_virtual_environment_download_file.images["ubuntu_jammy_cloud_image"] will be created
+ module.ubuntu_jammy_cloud_image.random_id.image_id["ubuntu_jammy_cloud_image"] will be created
+ module.ubuntu_jammy_image.proxmox_virtual_environment_download_file.images["ubuntu_jammy"] will be created
+ module.ubuntu_jammy_image.random_id.image_id["ubuntu_jammy"] will be created
+ module.ubuntu_noble_cloud_image.proxmox_virtual_environment_download_file.images["ubuntu_noble_cloud_image"] will be created
+ module.ubuntu_noble_cloud_image.random_id.image_id["ubuntu_noble_cloud_image"] will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 16 to add, 0 to change, 4 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-07-13T05:14:43Z [(view log)](https://github.com/perchnet/p/actions/runs/16245690153/job/45868298079#step:9:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # tailscale_tailnet_key.key will be created
  + resource "tailscale_tailnet_key" "key" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + expiry        = 3600
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = false
      + tags          = [
          + "tag:periphery",
        ]
      + user_id       = (known after apply)
    }

  # module.coreos-module-vm.htpasswd_password.password_hash will be destroyed
  # (because htpasswd_password.password_hash is not in configuration)
  - resource "htpasswd_password" "password_hash" {
      - apr1     = "$apr1$xlnuxZM/$lsySBdBk7eevAQg501FnT1" -> null
      - bcrypt   = "$2a$10$ergdn9K7zm8drq/hpVdZ6eSo5T4N39rGmug3w10A7M668N3hLMMfS" -> null
      - id       = "PW24326124313024657267646e394b377a6d386472712f687056645a3665536f3554344e333972476d75673377313041374d3636384e33684c4d4d6653" -> null
      - password = (sensitive value) -> null
      - sha256   = "5d83535eb8c55d4747c0bc670e0897e9cc98ee53592f5131a0a9b68f59d7fe9e" -> null
      - sha512   = "$6$$hqSgrdfOzV1bASEpb57MUpMiaLa6HGTiVMXaCuIssHXTGPgDTQDhLouYki9Ny9NPrr/jRFnWOgdGiVui1dm8t/" -> null
    }

  # module.coreos-module-vm.random_pet.random_hostname will be destroyed
  # (because random_pet.random_hostname is not in configuration)
  - resource "random_pet" "random_hostname" {
      - id        = "ideal-mammal" -> null
      - keepers   = {
          - "flat_hash" = (sensitive value)
        } -> null
      - length    = 2 -> null
      - separator = "-" -> null
    }

  # module.coreos-module-vm2.htpasswd_password.password_hash will be destroyed
  # (because htpasswd_password.password_hash is not in configuration)
  - resource "htpasswd_password" "password_hash" {
      - apr1     = "$apr1$CIrGr2Ql$rzmXRfpYlkqJBNJh7LVlI/" -> null
      - bcrypt   = "$2a$10$1YSYxLy/9lonDgbkYgiUpOtJJrfJOUi2tuPNR7JoLt.0FA1siUYRy" -> null
      - id       = "PW2432612431302431595359784c792f396c6f6e4467626b59676955704f744a4a72664a4f5569327475504e52374a6f4c742e30464131736955595279" -> null
      - password = (sensitive value) -> null
      - sha256   = "5d83535eb8c55d4747c0bc670e0897e9cc98ee53592f5131a0a9b68f59d7fe9e" -> null
      - sha512   = "$6$$hqSgrdfOzV1bASEpb57MUpMiaLa6HGTiVMXaCuIssHXTGPgDTQDhLouYki9Ny9NPrr/jRFnWOgdGiVui1dm8t/" -> null
    }

  # module.coreos-module-vm2.random_pet.random_hostname will be destroyed
  # (because random_pet.random_hostname is not in configuration)
  - resource "random_pet" "random_hostname" {
      - id        = "content-bat" -> null
      - keepers   = {
          - "flat_hash" = (sensitive value)
        } -> null
      - length    = 2 -> null
      - separator = "-" -> null
    }

  # module.coreos-periphery-vm.data.ct_config.fedora-coreos-config will be read during apply
  # (config refers to values not yet known)
 <= data "ct_config" "fedora-coreos-config" {
      + content      = (sensitive value)
      + id           = (known after apply)
      + pretty_print = true
      + rendered     = (known after apply)
      + snippets     = (sensitive value)
      + strict       = true
    }

  # module.coreos-periphery-vm.htpasswd_password.password_hash will be created
  + resource "htpasswd_password" "password_hash" {
      + apr1     = (known after apply)
      + bcrypt   = (known after apply)
      + id       = (known after apply)
      + password = (sensitive value)
      + sha256   = (known after apply)
      + sha512   = (known after apply)
    }

  # module.coreos-periphery-vm.proxmox_virtual_environment_file.cloud_user_config will be created
  + resource "proxmox_virtual_environment_file" "cloud_user_config" {
      + content_type           = "snippets"
      + datastore_id           = "snippets"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "pve1"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = (sensitive value)
          + file_name = (known after apply)
          + resize    = 0
        }
    }

  # module.coreos-periphery-vm.proxmox_virtual_environment_vm.coreos_vm will be created
  + resource "proxmox_virtual_environment_vm" "coreos_vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "coreos-periphery-test"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "zssd"
          + discard           = "ignore"
          + file_format       = (known after apply)
          + file_id           = (known after apply)
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 20
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "local-zfs"
          + interface            = "ide2"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
        }

      + memory {
          + dedicated      = 2048
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + serial_device {
          + device = "socket"
        }

      + vga {
          + memory = 16
          + type   = "std"
        }
    }

  # module.coreos_image.proxmox_virtual_environment_download_file.images["coreos_img"] will be created
  + resource "proxmox_virtual_environment_download_file" "images" {
      + checksum                = "7fb66f45fd80e2bb33c5d1c1899fdce47b00c2abc9159f6c03f60a7ebd9c18a1"
      + checksum_algorithm      = "sha256"
      + content_type            = "iso"
      + datastore_id            = "zssd-files"
      + decompression_algorithm = "zst"
      + file_name               = (known after apply)
      + id                      = (known after apply)
      + node_name               = "pve1"
      + overwrite               = true
      + overwrite_unmanaged     = false
      + size                    = (known after apply)
      + upload_timeout          = 600
      + url                     = "https://builds.coreos.fedoraproject.org/prod/streams/testing/builds/42.20250705.2.0/x86_64/fedora-coreos-42.20250705.2.0-proxmoxve.x86_64.qcow2.xz"
      + verify                  = true
    }

  # module.coreos_image.random_id.image_id["coreos_img"] will be created
  + resource "random_id" "image_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "url" = "https://builds.coreos.fedoraproject.org/prod/streams/testing/builds/42.20250705.2.0/x86_64/fedora-coreos-42.20250705.2.0-proxmoxve.x86_64.qcow2.xz"
        }
    }

  # module.debian_bookworm_image.proxmox_virtual_environment_download_file.images["debian_bookworm"] will be created
  + resource "proxmox_virtual_environment_download_file" "images" {
      + checksum            = "38557e6d8e8738392dc5959b679c4567dbe4ce6475aaa3ba054caab4f1e4f90876c49f6e20be79a5a151105e121f2e19a51319bdb0a223c90fea11b0a13deb25"
      + checksum_algorithm  = "sha512"
      + content_type        = "iso"
      + datastore_id        = "zssd-files"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "pve1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://cloud.debian.org/images/cloud/bookworm/20250428-2096/debian-12-nocloud-amd64-20250428-2096.qcow2"
      + verify              = true
    }

  # module.debian_bookworm_image.random_id.image_id["debian_bookworm"] will be created
  + resource "random_id" "image_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "url" = "https://cloud.debian.org/images/cloud/bookworm/20250428-2096/debian-12-nocloud-amd64-20250428-2096.qcow2"
        }
    }

  # module.debian_trixie_image.proxmox_virtual_environment_download_file.images["debian_trixie"] will be created
  + resource "proxmox_virtual_environment_download_file" "images" {
      + checksum            = "046d9691b1a6026fd457b85c85476fa721249dd9379e23ab877bb34b2d6fa662994b03a23ffe7b527c5421cb1a69e81b6873c82f0e1ac9403bbaad263fffd3d8"
      + checksum_algorithm  = "sha512"
      + content_type        = "iso"
      + datastore_id        = "zssd-files"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "pve1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://cloud.debian.org/images/cloud/trixie/daily/20250619-2148/debian-13-generic-amd64-daily-20250619-2148.qcow2"
      + verify              = true
    }

  # module.debian_trixie_image.random_id.image_id["debian_trixie"] will be created
  + resource "random_id" "image_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "url" = "https://cloud.debian.org/images/cloud/trixie/daily/20250619-2148/debian-13-generic-amd64-daily-20250619-2148.qcow2"
        }
    }

  # module.ubuntu_jammy_cloud_image.proxmox_virtual_environment_download_file.images["ubuntu_jammy_cloud_image"] will be created
  + resource "proxmox_virtual_environment_download_file" "images" {
      + content_type        = "iso"
      + datastore_id        = "zssd-files"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "pve1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img"
      + verify              = true
    }

  # module.ubuntu_jammy_cloud_image.random_id.image_id["ubuntu_jammy_cloud_image"] will be created
  + resource "random_id" "image_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "url" = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img"
        }
    }

  # module.ubuntu_jammy_image.proxmox_virtual_environment_download_file.images["ubuntu_jammy"] will be created
  + resource "proxmox_virtual_environment_download_file" "images" {
      + content_type        = "iso"
      + datastore_id        = "zssd-files"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "pve1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img"
      + verify              = true
    }

  # module.ubuntu_jammy_image.random_id.image_id["ubuntu_jammy"] will be created
  + resource "random_id" "image_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "url" = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img"
        }
    }

  # module.ubuntu_noble_cloud_image.proxmox_virtual_environment_download_file.images["ubuntu_noble_cloud_image"] will be created
  + resource "proxmox_virtual_environment_download_file" "images" {
      + checksum            = "92d2c4591af9a82785464bede56022c49d4be27bde1bdcf4a9fccc62425cda43"
      + checksum_algorithm  = "sha256"
      + content_type        = "iso"
      + datastore_id        = "zssd-files"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "pve1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://cloud-images.ubuntu.com/noble/20250610/noble-server-cloudimg-amd64.img"
      + verify              = true
    }

  # module.ubuntu_noble_cloud_image.random_id.image_id["ubuntu_noble_cloud_image"] will be created
  + resource "random_id" "image_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "url" = "https://cloud-images.ubuntu.com/noble/20250610/noble-server-cloudimg-amd64.img"
        }
    }

Plan: 16 to add, 0 to change, 4 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-33-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->